Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/types_of_employment/self_employment/setting_up_a_business_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: • Tax, PRSI and employing staff
ga: • Cáin, ÁSPC agus fostú foirne

source: If you are thinking of setting up a business there are a number of issues you need to consider
ga: Má tá tú ag brath gnó a bhunú tá roinnt ceisteanna nár mhór duit a chur san áireamh

source: Different supports and regulations apply, depending on your particular situation
ga: Tá tacaí agus rialacha seachas a chéile i bhfeidhm, de réir do chuid tosca féin

source: You may be employed, unemployed or someone who is coming from outside Ireland to set up a business
ga: B'fhéidir gur duine fostaithe nó dífhostaithe thú nó duine atá ag teacht anall go hÉirinn le gnó a chur ar bun

source: This document highlights some of the important information you need to know with links to relevant topics
ga: Léiríonn an cháipéis seo cuid den fhaisnéis thábhachtach nár mhór a bheith agat, mar aon le naisc chun na dtopaicí ábhartha

source: You can read more in our documents, Sources of information on starting a business and Becoming self-employed
ga: Léigh tuilleadh inár ndoiciméid, Foinsí faisnéise maidir le gnó a chur ar bun agus Chun bheith féinfhostaithe

source: Local Enterprise Offices provide supports to local businesses that are starting up or in development
ga: Tugann Oifigí Fiontair Áitiúla an tacaí do ghnóthais áitiúla atá á mbunú nó á bhforbairt

source: Their role is to stimulate economic activity at local level and to promote microenterprises (10 or fewer employees)
ga: Is é a ról gníomhaíocht gheilleagrach a spreagadh agus micreathionscadail (10 bhfostaí nó níos lú) a chur chun cinn

source: You can find information about their training programmes and start your own business courses as well as mentoring and financial supports on localenterprise.ie
ga: Tá faisnéis maidir le cláir oiliúna agus cúrsaí faoi do ghnó a chur ar bun, chomh maith le meantóireacht agus tacaíochtaí airgeadais ar fáil ar localenterprise.ie

source: New Frontiers is a development programme for potential entrepreneurs, funded and coordinated by Enterprise Ireland, which is delivered locally by Institutes of Technology
ga: Is é New Frontiers clár forbartha d’fhiontraithe féideartha, a bheidh á chistiú agus á chomhordú ag Fiontar Éireann, le seachadadh go háitiúil ag 13 Institiúid Teicneolaíochta

source: If you are unemployed you may be eligible for the Back to Work Enterprise Allowance (BTWEA) or the Short-Term Enterprise Allowance (STEA)
ga: Má tá tú dífhostaithe b'fhéidir go mbeidh teideal agat ar scéim an Liúntais Fiontraíochta um Fhilleadh ar Obair nó ar scéim an Liúntas Fiontraíochta Gearrthéarmach

source: If you are starting a business, you also may get extra supports under these schemes, such as grants for training, market research and business plans as well as access to loans to buy equipment
ga: Má tá tú ag cur gnó ar bun, b'fhéidir go bhfaighidh tú tacaí breise de bhun na scéime, mar shampla deontais le haghaidh oiliúna, taighde margaidh, pleananna gnó, agus le bheith in ann iasachtaí a fháil le fearas a cheannach

source: The Start Your Own Business Relief provides relief from income tax to people who are unemployed for at least 12 months and who set up a qualifying business
ga: Soláthraíonn an scéim Do Chuid Gnó a Chur ar Bun (SYOB) faoiseamh cánach do dhaoine atá dífhostaithe ar feadh 12 mhí ar a laghad, ag fáil íocaíocht leasa shóisialaigh agus atá ag cur gnó incháilithe ar bun

source: It runs from 23 October 2013 to 31 December 2018
ga: Ritheann an scéim ó 23 Deireadh Fómhair 2013 go 31 Nollaig 2016

source: Nationals of the European Economic Area (EEA) or Switzerland do not need permission to set up a business in Ireland
ga: Ní chaithfidh saoránaigh an Limistéir Eorpaigh Eacnamaíoch (LEE) ná na hEilvéise cead a bheith acu gnó a chur ar bun in Éirinn

source: Generally, non-EEA nationals must get permission from the Minister for Justice and Equality in order to set up a business in Ireland
ga: De ghnáth caithfidh daoine nach saoránaigh de chuid an LEE iad cead a fháil ón Aire Dlí agus Cirt agus Comhionannais le gnó a chur ar bun in Éirinn

source: They may be eligible to apply for the Immigrant Investor Programme or the Start-up Entrepreneur Programme
ga: D’fhéadfadh iad bheith incháilithe iarratas ar an gClár Infheisteoir Inimircigh nó ar an gClár Tionscnaimh d’Fhiontraithe

source: If they wish to start a retail, catering, personal services or similar business they should apply for the business permission scheme
ga: Más mian leo gnó miondíola, lónadóireachta, seirbhisí pearsanta nó gnóthaí dá samhail a bhunú, caithfidh siad iarratas a dhéanamh ar an scéim cead gnó

source: You can set up a business as a sole trader, as a partnership or as a limited company
ga: Féadfaidh tú gnó a bhunú mar thrádálaí aonair, i gcomhpháirtíocht nó mar chuideachta theoranta

source: The type of structure you choose depends on the kind of business you are running, with whom you will be doing business and your attitude to risk
ga: Braithfidh rogha an struchtúir ar an gcineál gnó a bhfuil tú ina bhun, ar na custaiméirí a bheidh agat agus ar do sheasamh maidir le riosca

source: It is advisable to get the advice of a solicitor or accountant when considering the structure for your business
ga: Moltar duit dul i gcomhairle le haturnae nó le cuntasóir maidir le struchtúr do ghnó

source: The Companies Registration Office (CRO) has information about these different structures on its website, cro.ie
ga: Tá faisnéis faoi na struchtúir éagsúla ag an Oifig um Chlárú Cuideachtaí ar a shuíomh gréasáin, cro.ie

source: It is relatively simple to set up as a sole trader but if your business fails, your personal assets could be used to pay your creditors
ga: Tá sé éasca go leor dul i mbun gnó mar thrádálaí aonair ach má chliseann air seo d'fhéadfaí do shócmhainní pearsanta a úsáid le do chreidiúnaithe a íoc

source: Your main legal obligation is that you must register as a self-employed person with Revenue (see ‘Tax and PRSI’ below)
ga: Is é an príomhdhualgas atá ort ó thaobh an dlí clárú mar dhuine féinfhostaithe leis na Coimisinéirí Ioncaim (féach leat ‘Cáin agus ÁSPC' anseo thíos)

source: If you wish to use a business name you must register your business name with the Companies Registration Office (CRO)
ga: Más mian leat ainm gnó a úsáid caithfidh tú é a chlárú leis an Oifig um Chlárú Cuideachtaí

source: This is where 2 or more people agree to run a business in partnership with each other
ga: Is éard atá i gcomhpháirtíocht 2 nó níos mó daoine teacht le chéile d'fhonn gnó a bhainistiú i bpáirt le chéile

source: The partnership agreement should be drawn up by a solicitor
ga: Níor mhór an comhaontú comhpháirtíochta a chur á dhréachtú ag aturnae

source: The partners are jointly responsible for running the business and if it fails all partners are jointly responsible for the debt
ga: Tá na comhpháirtithe comhfhreagrach as bainistíocht an ghnó agus má chliseann air seo tá na comhpháirtithe comhfhreagrach as na fiacha

source: If you set up your business as a limited company, the business is a separate legal entity
ga: Má bhunaíonn tú do ghnó mar chuideachta theoranta, is eintiteas dlíthiúil ar leith é an gnó

source: If the company gets into debt, the creditors generally only have a claim on the assets of the company
ga: Má bhíonn fiacha ar an gcuideachta, ní bhíonn teideal de ghnáth ag na creidiúnaithe ach ar shócmhainní na cuideachta

source: The company must be registered with the Companies Registration Office (CRO) and the company reports and accounts must be returned to the CRO each year
ga: Ní mór an chuideachta a chlárú leis an Oifig um Chlárú Cuideachtaí (OCC) agus ní mór tuarascálacha agus cuntais na cuideachta a chur faoi bhráid na hOCC gach bliain

source: The Companies Act 2014, which replaced the Companies Acts 1963-2013, came into effect on 1 June 2015
ga: Tháinig Acht na gCuideachtaí 2014, a thagann in ionad Achtanna na gCuideachtaí, 1963-2013, i bhfeidhm an 1 Meitheamh 2015

source: Under the Act, private companies limited by shares can be registered as an LTD (private company limited by shares) or a DAC (Designated Activity Company)
ga: Faoin Acht, is féidir gach cuideachta phríobháideach reatha atá faoi theorainn scaireanna roghnú chun tiontú ina gcuideachtaí TEORANTA (cuideachta phríobháideach faoi theorainn scaireanna) nó cuideachta CGA (Cuideachta Ghníomhaíochta Ainmnithe)

source: You can read more about the requirements for different types of companies under the Companies Act 2014
ga: Léigh tuilleadh faoi na riachtanais le haghaidh saghsanna difriúla cuideachtaí faoin Acht na gCuideachtaí 2014

source: You can register your business name and file company returns online with the CRO using CORE (Companies Online Registration Environment)
ga: Féadfaidh tú d'ainm gnó agus do chuid tuairisceán bliantúil a chlárú agus a chomhdú leis an OCC ach úsáid a bhaint as CORE (Timpeallacht Cláraithe Cuideachtaí Ar-Líne)

source: Microfinance Ireland provides loans to small businesses with no more than 10 employees, including sole traders and start-ups
ga: Soláthraíonn Micreamhaoiniúcháin Éire iasachtaí do ghnéithe beaga nach bhfuil níos mó ná 10 bhfostaí acu, lena n-áirítear trádálaí aonair agus gnólachtaí nuathionscanta

source: The loans of between €2,000 and €25,000 are for commercially viable proposals
ga: Tá na hiasachtaí idir €2,000 agus €25,000 do thograí inmharthana ó thaobh tráchtála

source: Since September 2015, under the Microenterprise Loan Fund Scheme 2015, there is no longer a requirement to have been refused credit by the banks
ga: Ó Meán Fómhair 2015, faoin Scéim Ciste Iasachta do Mhicreathionscadail, níl aon riachtanas bheith iarratas ar chreidmheas diúltaithe ag na bainc acu

source: Forms and details of how to apply are available on microfinance.ie
ga: Tá sonraí faoi conas iarratas a dhéanamh agus foirmeacha ar fáil ar microfinance.ie

source: JobsPlus is an employer incentive which encourages and rewards employers who employ jobseekers on the Live Register
ga: Is JobsPlus dreasacht fostóirí a spreagann fostóirí a fhostaíonn cuardaitheoirí poist ar an Beochlár

source: There are 2 levels of incentive: €7,500 for recruits unemployed for more than 12 but less than 24 months and €10,000 for recruits unemployed for more than 24 months
ga: Tá 2 leibhéal dreasachta ann: €7,500 le haghaidh earcach atá dífhostaithe ar feadh idir 12 agus 24 mhí agus €10,000 le haghaidh earcach atá dífhostaithe níos mó ná 24 mhí

source: Eligible employers who recruit full-time employees on or after 1 July 2013 may apply for the incentive
ga: Is féidir le fostóirí incháilithe a earcaíonn fostaithe lánaimseartha ar nó i ndiaidh 1 Iúil 2013, iarratas ar an dreasacht a dhéanamh

source: JobsPlus has replaced the Revenue Job Assist and Employer Job (PRSI) Exemption Scheme both of which ended on 30 June 2013, but existing participants on these schemes will not be affected
ga: Oibreoidh an dreasacht ar bonn treoirscéime ar dtús. Cuireadh JobsPlus in áit Postchúnamh Ioncaim agus in áit na Scéime Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí ach ní bhainfidh sé le rannpháirtithe reatha

source: Under the Trading Online Voucher Scheme vouchers of up to €2,500 may be available to businesses who demonstrate that they have a credible plan for trading online
ga: Faoin Scéim Dearbháin Trádála Ar Líne beidh dearbháin suas le €2,500 ar fáil do ghnólachtaí a léiríonn go bhfuil plean inchreidte acu le haghaidh trádáil ar líne

source: Further details are available from your Local Enterprise Office
ga: Leathnaítear an scéim chuig gach contae i rith 2014 agus tá sonraí ar fáil ó d’Oifig Fhiontraíochta Áitiúil

source: If you have a small or medium business and your application for credit is refused by one of the participating banks you may apply to the Credit Review Office to have your case reviewed
ga: Má tá gnó beag nó meánmhéide agat agus má dhiúltaíonn ceann de na bainc atá rannpháirteach d'iarratas ar chreidmheas is féidir leat iarratas a dhéanamh ar an Oifig um Athbhreithniú Creidmheasa chun do chás a athbhreithniú

source: To be eligible for a review your application must have been in writing
ga: Chun a bheith incháilithe le haghaidh athbhreithnithe ní mór d'iarratas a bheith déanta i scríbhinn

source: There is an application form on the website of the Credit Review Office
ga: Tá foirm iarratais ar shuíomh gréasáin an Oifig um Athbhreithniú Creidmheasa

source: The fee for the review ranges from €100 up to a maximum of €250
ga: Cosnaíonn athbhreithniú idir €100 suas go dtí uasmhéid de €250

source: The Credit Guarantee Scheme aims to encourage additional lending to small and medium businesses who are commercially viable but have difficulty in accessing credit
ga: Is é aidhm na Scéime Ráthaíocht Creidmheasa iasacht bhreise a spreagadh do ghnólachtaí beaga agus meánmhéide atá inmharthana ó thaobh tráchtála ach tá deacrachtaí acu rochtain ar chreidmheas a fháil

source: Under the Scheme eligible applicants will be assisted in obtaining a loan and in establishing a favourable credit history. You can find out more in the information booklet about the Scheme
ga: Faoin Scéim tabharfar cúnamh d’iarratasóirí incháilithe chun iasacht a fháil agus chun stair chreidmheas fhabhrach a bhunú

source: Since 3 March 2017, changes to the Credit Guarantee Scheme extend the definition of loan agreements to include certain non-credit products such as overdrafts
ga: Ó 23 Feabhra 2015, cuimsíonn athruithe ar an Scéim Ráthaíocht Creidmheasa méadú uasthréimhse ráthaíocht ó 3 go 7 bliain

source: The scope of the scheme also extends to cover other financial product providers for example lessors
ga: Chomh maith le sin, má fhágann banc an ghnó an mhargaidh creidmheasa Éireannach, ceadaíonn an Scéim iasachtaí athmhaoinithe anois

source: If you are having difficulties with your creditors the Chartered Accountants Voluntary Advice service - CAVA (pdf) can give free advice and assistance on your business affairs
ga: Má tá deacrachtaí agat le do chreidiúnaithe, is féidir leis an tSeirbhís Chomhairle Deonach Cuntasóirí Cairte - CAVA (pdf) comhairle agus cabhair saor in aisce le haghaidh do chúrsaí ghnólachta a thabhairt

source: Contact your local Citizens Information Service or Money Advice and Budgeting Service (MABS) to see if they offer the service
ga: Déan teagmháil le do Sheirbhís Fhaisnéise do Shaoránaigh nó do Sheirbhís Buiséadaithe agus Comhairle Airgid (SBCA) agus faigh amach an bhfuil an tseirbhís ar fáil acu

source: Tax, PRSI and employing staff
ga: Cáin, ÁSPC agus fostú foirne

source: How your business is taxed depends on whether it is incorporated as a company
ga: Leagfar cáin ar do ghnó de réir mar atá sé corpraithe ina chuideachta nó nach bhfuil

source: If it is a company then it is liable for corporation tax
ga: Más cuideachta é beidh cáin chorparáide inghearrtha air

source: If your business is not incorporated you are considered to be a sole trader and you pay tax under the self-assessment system
ga: Mura bhfuil sé corpraithe measfar gur trádálaí aonair thú agus íocfaidh tú cáin de réir an chórais féinmheasúnaithe

source: Further information on tax is available in our document on tax for self-employed people and from Revenue
ga: Tá tuilleadh eolais le fáil inár ndoiciméad maidir le cáin do dhaoine féinfhostaithe agus ó na Coimisinéirí Ioncaim

source: Earned Income tax credit: In 2016, taxpayers earning self-employed trading or professional income could claim an Earned Income tax credit of €550. In 2017 the Earned Income tax credit increases to €950 for self-employed taxpayers
ga: Creidmheas cánach Ioncaim Tuillte: Ag tosú i 2016, is féidir cáiníocóirí a thuilleann ioncam trádála nó gairmiúil creidmheas cánach nua Ioncaim Tuillte €550 a éileamh

source: It is also available for business owners or managers who are not eligible for a PAYE credit on their salary income
ga: Tá sé ar fáil d’úinéirí gnó nó bainisteoirí nach bhfuil incháilithe le haghaidh creidmheasa IMAT ar a dtuarastal

source: If a taxpayer also qualifies for the PAYE tax credit, the combined value of these 2 tax credits cannot exceed €1,650
ga: Má cháilíonn cáiníocóir le haghaidh creidmheas cánach IMAT freisin, ní féidir leis an luach comhcheangailte na 2 creidmheas cánach €1,650 a shárú

source: SURE tax refund: The Start Up Refunds for Entrepreneurs (SURE) is a tax refund scheme that allows eligible people to get a refund of up to 41% of the capital they invest in starting a business
ga: Aisíocaíocht cánach SURE: Scéim nua aisíocaíochta cánach is ea Aisíocaíochtaí Gnólachtaí Nuathionscanta d’Fhiontraithe (SURE) a cheadaíonn do dhaoine incháilithe chun aisíocaíocht a mhéid le 41% den chaipiteal a infheistíonn siad i ngnólacht a thosú

source: Under the SURE scheme you may be entitled to a refund of PAYE income tax that you paid over the 6 years before the year in which you invest
ga: Faoi Scéim SURE, b’fhéidir go mbeidh tú i dteideal aisíocaíocht a fháil ar cháin ioncaim ÍMAT a d’íoc tú i gcaitheamh na 6 bliana roimh an mbliain ina ndéanann tú infheistíocht

source: You can read the Revenue guide IT15 for further details of the SURE scheme
ga: Féadfaidh tú treoir IT15 na gCoimisinéirí Ioncaim a léamh chun teacht ar bhreis sonraí faoi scéim SURE

source: You can use the online calculator on sure.gov.ie to estimate your potential refund
ga: Féadfaidh tú an t-áireamhán ar líne ar sure.gov.ie a úsáid chun d’aisíocaíocht fhéideartha a mheas

source: Start-up companies: New companies may get tax relief on the first 3 years of corporation tax and the value of the relief will be linked to the amount of employers’ PRSI paid by a company in an accounting period subject to a maximum of €5,000 per employee
ga: Cuideachtaí nua: Is féidir le cuideachtaí nua bheith díolmhaithe ó cháin chorparáide ar feadh 3 bliain agus beidh luach an faoiseamh nasctha leis an méid ÁSPC fhostóir atá íoctha ag cuideachta i dtréimhse chuntasaíochta suas go huasmhéid €5,000 do gach fostaí

source: In the Finance Act 2013, the tax relief was extended to allow any unused relief arising in the first 3 years of trading to be carried forward for use in subsequent years
ga: San Acht Airgeadais 2013, síníodh an faoiseamh cánach seo chun ceadú aon fhaoiseamh cánach neamhúsáidte ón chéad 3 bhliain trádála a thabhairt ar aghaidh chuig úsáid i mbliana ina dhiaidh sin

source: The relief was extended to companies that started trading in 2012, 2013, 2014 or 2015 and, in the Finance Act 2015, to companies that start trading in 2016, 2017 or 2018
ga: Síníodh an faoiseamh cánach do chuideachtaí a thosaigh i 2012, 2013, 2014 nó 2015 agus, san Acht Airgeadais 2015, síníodh é do chuideachtaí a thosaíonn i 2016, 2017 nó 2018

source: Capital Gains Tax (CGT) relief: If you sell your business on or after 1 January 2016, a lower CGT rate of 20% will apply to the net chargeable gains arising from the sale of all or part of your business, up to a lifetime limit of €1 million
ga: Faoiseamh ar Cháin Ghnóthachan Caipitiúil (CGC): má dhíolann tú do ghnó ar nó i ndiaidh 1 Eanáir 2016, baineann íosráta CGC 20% le glangnóthachan inmhuirir as díol iomlán nó páirt do ghnó, suas go dtí teorainn saoil €1 milliún

source: If you are self-employed you pay Class S social insurance contributions
ga: Más duine féinfhostaithe thú íocfaidh tú ranníocaíochtaí árachais shóisialta Aicme S

source: There is a guide, PRSI for the Self-Employed on welfare.ie
ga: Tá Treoir ÁSPC do Dhaoine Féinfhostaithe ar welfare.ie

source: If you are an employer and you created new and additional jobs in 2012 you may have qualified for an exemption of employer’s PRSI for those jobs
ga: Más fostóir thú agus má chruthaigh tú poist nua agus bhreise in 2012, b’fhéidir gur cháiligh tú do dhíolúine ÁSPC fostóra do na poist seo

source: In 2013 this scheme was replaced by the JobsPlus incentive, which aims to encourage employers to hire individuals that are long-term unemployed - see 'Funding' above
ga: In 2013, tháinig dreasacht JobsPlus in ionad na scéime seo, a bhfuil de chuspóir aici fostóirí a spreagadh chun daoine a fhostú atá dífhostaithe go fadtéarmach – féach ‘Cistiú’ thuas

source: If you are starting up a business and decide to recruit staff you must register for PAYE and PRSI with Revenue
ga: Má tá tú ag cur gnó ar bun agus má shocraíonn tú foireann a earcú, caithfidh tú clárú le haghaidh ÍMAT agus ÁSPC leis na Coimisinéirí Ioncaim

source: You can find information in our document about your obligations and duties as an employer and what are the rights of employees
ga: Is féidir leat faigh amach faisnéis maidir le d’oibleagáidí agus do dhualgais mar fhostóir, agus céard iad cearta na bhfostaithe

source: There is a guide for employers who are starting a new business with a paid employee (pdf)
ga: Tá treoir d' fhostóirí atá ag bunú gnó le fostaí (pdf) ar fáil

source: You can also read our documents on topics such as the minimum wage, social insurance (PRSI), leave and health and safety
ga: Is féidir leat ár ndoiciméid faoi íosphá, íocaíocht leasa shóisialta (ASPC), saoire agus sláinte agus sábháilteacht a léamh

source: You can find more information in our documents on sources of information on starting a business, becoming self-employed and closing or selling a business
ga: Tá tuilleadh faisnéise ar fáil inár ndoiciméid faoi fhoinsí faisnéise maidir le féinfhostaíocht, chun bheith féinfhostaithe agus gno a dhúnadh nó a dhíol
